{
  "1": {
    "category": "morphology",
    "type": "open",
    "name": "[A] Open",
    "tooltip": "Open Node là một phép toán kết hợp giữa phép mở rộng (dilate) và phép co (erode). Kết quả của phép toán Open là làm mở rộng các vùng trắng trong ảnh, đồng thời giảm nhiễu và điền vào các lỗ hở giữa các đối tượng trắng.",
    "params": {
      "ksize": 3
    }
  },
  "2": {
    "category": "morphology",
    "type": "close",
    "name": "[A] Close",
    "tooltip": "Close Node là một phép toán kết hợp giữa phép co (erode) và phép mở rộng (dilate). Kết quả của phép toán Close là làm co lại các vùng trắng trong ảnh, đồng thời lấp đầy các lỗ hở giữa các đối tượng trắng.",
    "params": {
      "ksize": 3
    }
  },
  "3": {
    "category": "morphology",
    "type": "erode",
    "name": "[B] Erode",
    "tooltip": "Erode Node là một phép toán thu nhỏ (co) đối tượng trắng trong ảnh bằng cách xóa bỏ các pixel trắng ở rìa của đối tượng. Kết quả của phép toán Erode là làm co lại các vùng trắng trong ảnh, làm giảm kích thước và thay đổi hình dạng của đối tượng.",
    "params": {
      "ksize": 3
    }
  },
  "4": {
    "category": "morphology",
    "type": "dilate",
    "name": "[B] Dilate",
    "tooltip": "Dilation Node là một phép toán làm dày (dãn) đối tượng trắng trong ảnh bằng cách thêm các pixel trắng vào các điểm lân cận của đối tượng. Kết quả của phép toán Dilation là làm dày lại các vùng trắng trong ảnh, làm tăng kích thước và thay đổi hình dạng của đối tượng.",
    "params": {
      "ksize": 3
    }
  },
  "5": {
    "category": "morphology",
    "type": "tophat",
    "name": "[A] TopHat",
    "tooltip": "TopHat Node tìm ra các đối tượng nhỏ hoặc chi tiết trong ảnh, có thể là các điểm sáng hoặc điểm tối so với nền ảnh ban đầu.",
    "params": {
      "ksize": 3
    }
  },
  "6": {
    "category": "morphology",
    "type": "blackhat",
    "name": "[A] BlackHat",
    "tooltip": "BlackHat Node làm nổi bật những đối tượng nhỏ, nhiễu, hoặc cạnh của đối tượng trong ảnh.",
    "params": {
      "ksize": 3
    }
  }
}